{
  "titulo": "CLASSES E SUBCLASSES DO WILD RIFT",
  "paginas": [
    {
      "numero": 1,
      "conteudo": "CLASSES E SUBCLASSES WildRift"
    },
    {
      "numero": 2,
      "conteudo": "# SUMÁRIO\nIntrodução ...... 1\nAtiradores ...... 2\n    Ad caster ...... 3\n    Hiper carregador ...... 4\n    Early carrys ...... 5\n    Carregador utilidade ...... 6\nMatadores ...... 9\n    Assassinos ...... 10\n    Duelistas ...... 11\nMagos ...... 13\n    Magos de burst ...... 14\n    Magos de batalha ...... 15\n    Magos de artilharia ...... 16\nControladores ...... 18\n    Encantadores ...... 19\n    Apanhadores ...... 20\nTanques ...... 22\n    Guardiões ...... 23\n    Vanguarda ...... 24\nLutadores ...... 26\n    Colossos ...... 27\n    Divers ...... 28\nEspecialistas ...... 33\nComo escolher sua classe ...... 47"
    },
    {
      "numero": 3,
      "conteudo": "# INTRODUÇÃO\nNo League of Legends, os campeões são divididos em 7 classes principais e 15 subclasses, similar aos jogos de RPG, embora não de forma explícita. Entender essas classificações é fundamental para maximizar o potencial de cada campeão e aprimorar seu estilo de jogo.\n\nCampeões da mesma classe compartilham características e papéis semelhantes no jogo, o que facilita compreender como devem ser jogados e como enfrentar seus adversários. É importante notar que alguns campeões podem pertencer a mais de uma classe.\n\nEmbora seja tecnicamente possível construir itens não convencionais para um campeão ou tentar exercer uma função diferente (como tentar tankar com um encantador), isso raramente é eficaz. Cada classe exige uma mentalidade específica e comportamentos adequados durante a partida para maximizar seu impacto durante o jogo.\n\n1"
    },
    {
      "numero": 4,
      "conteudo": "# ATIRADORES\nSão personagens de ataque à distância que dependem principalmente de seus ataques básicos como fonte de dano. Possuem alto DPS (dano por segundo) e geralmente são os únicos capazes de derrubar tanques, torres e objetivos neutros (dragões e barões) eficientemente.\n\n---\n\n## PONTOS POSITIVOS\n\n- Alto dano sustentado.\n- Eficiência contra objetivos.\n- Poder de escalar ao longo da partida.\n\n---\n\n## PONTOS NEGATIVOS\n\n- Extremamente frágeis.\n- Vulneráveis quando mal posicionados.\n- Early game geralmente mais fraco.\n\n---\n\nOs atiradores costumam ter um início de jogo mais lento, focando em farmar para adquirir itens essenciais. O posicionamento é crucial: devem se manter atrás do time, atacando de posições seguras para maximizar seu dano sem se expor.\n\n---\n\n2"
    },
    {
      "numero": 5,
      "conteudo": "# TIPOS DE ATIRADORES: AD CASTER\n\n## Atiradores focados em dano de habilidades em vez de ataques básicos, com maior alcance em suas skills.\n\n**PONTOS POSITIVOS**\n\n-  Power spike mais rápido\n(geralmente no mid-game\ncom três itens).\n\n-  Maior independência do\nsuporte.\n\n-  Habilidades defensivas e\nmobilidade.\n\n-  Capacidade de causar dano a\numa distância segura.\n\n**PONTOS NEGATIVOS**\n\n-  Dependência de skills e\nnecessidade de itens ou\nrunas que possam reduzir\nseu tempo de recarga.\n\n-  Geralmente os Ad casters\ncostumam ter um mid game\nmais explosivo e perder\nimpacto ao longo do jogo.\n\nEstilo de jogo: jogar em torno do tempo de recarga das habilidades,\nevitar exposição desnecessária quando skills defensivas estão\nem cooldown.\n\nExemplos: Ezreal, Corki, Lucian, Xayah, Smolder."
    },
    {
      "numero": 6,
      "conteudo": "# TIPOS DE ATIRADORES: HIPER CARREGADOR\n\nSubclasse com maior foco em DPS no late game, mas extremamente fraca no início.\n\n## PONTOS POSITIVOS\n\n- Dano massivo no late game.\n- Boas ferramentas para teamfights (resets, invisibilidade, dano em área).\n- Alto potencial de carregamento.\n\n## PONTOS NEGATIVOS\n\n- Early game ainda mais fraco em relação a outros atiradores.\n- Alta dependência de suportes, proteção, ajuda do time para reunir recursos e causar o máximo de dano possível em TF.\n\nEstilo de jogo: priorizar sobrevivência maxima em teamfights, focando inicialmente a frontline inimiga antes de avançar para a backline.\n\nExemplos: Jinx, Vayne, Sivir, Aphelios, Twitch, Kai'as, Zeri, Kog'Maw."
    },
    {
      "numero": 7,
      "conteudo": "# TIPOS DE ATIRADORES: EARLY CARRYS\n\nAtiradores com maior poder no início do jogo, mas com menor escala para o late game.\n\n## PONTOS POSITIVOS\n\n- Domínio de rota no early game.\n- Ferramentas para eliminar inimigos rapidamente.\n- Capacidade de construir vantagem cedo.\n\n## PONTOS NEGATIVOS\n\n- Perca relativa do seu poder ao longo do jogo.\n- Caso não consigam fazer snowball na rota, perdem significativamente suas chances carregar o jogo e consequentemente a relevância no jogo.\n\nEstilo de jogo: jogar agressivamente para construir vantagem através de objetivos, torres e abates nos estágios iniciais da partida.\n\nExemplos: Draven, Caitlyn, Kalista, Samira, Tristana.\n\n5"
    },
    {
      "numero": 8,
      "conteudo": "# TIPOS DE ATIRADORES: CARREGADOR UTILIDADE\n\nEspecialistas em controle de terreno através de habilidades de crowd control.\n\n## PONTOS POSITIVOS\n- Controle em área (slows, stuns, snares).\n- Capacidade de zonear com habilidades de longo alcance.\n- Habilidade de iniciar teamfights ou conseguir picks a distância.\n\n## PONTOS NEGATIVOS\n- Menor dano em comparação a outras subclasses de atiradores.\n- Geralmente não possuem skills de mobilidade, sendo alvos fáceis para campeões de alta mobilidade ou dano explosivo.\n\nEstilo de jogo: focar em utilidade para o time, controlando espaço e iniciando jogadas a distância segura.\n\nExemplos: Ashe, Varus, Senna, Jhin, Miss Fortune.\n\n6"
    },
    {
      "numero": 9,
      "conteudo": "# DICAS PARA JOGAR DE ATIRADOR\n\n- Priorize o posicionamento - Sua sobrevivência é mais importante que causar dano extra. Mantenha sempre uma distância segura e use obstáculos do terreno a seu favor.\n\n- Domine o farm - Atiradores dependem de itens, portanto, aperfeiçoe sua habilidade de conseguir o último golpe em minions para ganhar ouro consistentemente.\n\n- Economia de mobilidade - Se seu campeão tem habilidades de mobilidade (dash, flash, etc.), guarde-as para escapar de perigos ao invés de usá-las agressivamente, especialmente na fase de rotas.\n\n- Conheça seus power spikes - Cada atirador tem momentos específicos de poder baseados em níveis e itens:\n\nAD Casters: geralmente com 2-3 itens (mid game)\nHiper Carregadores: com 3+ itens (late game)\nEarly Carrys: nos primeiros níveis e com 1-2 itens\n\n- Pratique o kiting - A técnica de atacar enquanto se move na direção oposta ao inimigo é essencial. Configure bem seus controles para facilitar esse movimento.\n\n7"
    },
    {
      "numero": 10,
      "conteudo": "- Adaptação de alvos - Embora seja comum o conselho \"foque o mais próximo com segurança\", saiba quando é seguro focar um alvo prioritário mais distante.\n\n- Sinergia com suporte - Entenda o estilo de jogo do seu suporte: Com encantadores: jogue mais cautelosamente, escalando para o late game. Com apanhadores: siga engages e busque vantagem no early game. Com tanques: coordene pressão e dives quando possível. Compreenda suas fraquezas específicas:\n\nAD Casters: administre mana e cooldowns\nHiper Carregadores: sobreviva até seu power spike.\nEarly Carrys: capitalize vantagens rapidamente ou cairá em relevância.\nCarregadores de Utilidade: equilibre dano e utilidade para o time.\n\n8"
    },
    {
      "numero": 11,
      "conteudo": "# MATADORES\n\nGrupo de campeões focados principalmente em causar dano com alta mobilidade em seus kits. São especialmente eficazes contra alvos frágeis, podendo eliminá-los mesmo quando estão em desvantagem de ouro, desde que estes estejam fora de posição ou sem proteção.\n\n## PONTOS POSITIVOS\n\n- Alta mobilidade.\n- Dano concentrado/explosivo.\n- Capacidade de eliminar alvos prioritários rapidamente.\n\n## PONTOS NEGATIVOS\n- Alcance limitado (curto a médio).\n- Altamente punidos quando em desvantagem de ouro.\n- Pouca versatilidade de builds (maioria focada em dano).\n- Extrema vulnerabilidade a controle de grupo (CC).\n\nA principal fraqueza dos matadores é o controle de grupo. Quando pegos em um CC, tendem a ser eliminados rapidamente. O momento ideal para entrarem em luta é após o time inimigo ter usado seus controles de grupo em outros alvos.\n\n9"
    },
    {
      "numero": 12,
      "conteudo": "# TIPOS DE MATADORES: ASSASSINOS\n\nMatadores focados em dano explosivo, capazes de eliminar inimigos frágeis sem tempo para reação.\n\n---\n\n## PONTOS POSITIVOS\n\n- Dano explosivo instantâneo.\n- Habilidades de inviabilidade, invisibilidade e mobilidade.\n- Excelentes para punir alvos isolados.\n- Capacidade de entrar, eliminar e sair rapidamente das lutas.\n\n---\n\n## PONTOS NEGATIVOS\n\n- Os mais frágeis entre os matadores.\n- Alto risco/alta recompensa.\n- Dificuldade para controlar ondas de minions (baixo dano em área).\n- Menos eficazes em jogos muito coordenados/competitivos.\n\n---\n\nEstilo de jogo: requer \"malícia\" tática - análise do mapa, identificação de janelas de oportunidade e alvos vulneráveis. Comum focarem em roaming a partir da rota mid para buscar abates em outras rotas.\n\nExemplos: Akali, Akshan, Diana, Aurora, Ekko, Evelynn, Fizz, Katarina, Kassadin, Kayn (forma azul), Rengar, Talon, Yone, Zed, Naafiri, Kha'Zix, Nocturne, Pyke, Qiyana, Shaco.\n\n10"
    },
    {
      "numero": 13,
      "conteudo": "# TIPOS DE MATADORES: DUELISTAS\n\nSacrificam parte do dano explosivo por cooldowns menores, oferecendo DPS constante e mais confiável.\n\n---\n\n## PONTOS POSITIVOS\n- Habilidades que aumentam durabilidade em combate.\n- Especialistas em lutas 1v1.\n- Capacidade de virar combates aparentemente perdidos.\n- Dano constante e confiável (DPS).\n\n---\n\n## PONTOS NEGATIVOS\n- Menor mobilidade comparada a assassinos.\n- Alta curva de aprendizado/maestria.\n- Dependência de habilidades sensíveis (esquivas, bloqueios, curas).\n- Vulneráveis a campeões de longo alcance e CC.\n\n---\n\nEstilo de jogo: preferem lutar em torno do tempo de recarga de suas habilidades e geralmente dependem de suas ultimates para utilizar todo seu potencial. Similar aos colossos, são mais eficazes em split push e buscando flancos para acessar a backline inimiga. Devem evitar lutar na linha de frente quando suas habilidades defensivas estão em cooldown.\n\nExemplos: Fiora, Bel'Veth, Jax, Gwen, K'Sante, Kayn (forma vermelha), Kled, Lillia, Master Yi, Nilah, Riven, Sylas, Tryndamere, Viego, Yasuo, Yone.\n\n---\n\n11"
    },
    {
      "numero": 14,
      "conteudo": "# DICAS PARA JOGAR DE MATADOR\n\n-  Timing é tudo - Entre nas lutas após o inimigo ter usado\nsuas habilidades de CC.\n\n-  Conheça seus power spikes - Matadores geralmente têm\npower spikes específicos em certos níveis ou itens.\n\n-  Mapa é seu aliado - Especialmente como assassino, monitore\nconstantemente o mapa para oportunidades.\n\n-  Pratique combos - A eficácia dos matadores depende da\nexecução perfeita de suas combinações.\n\n-  Aprenda a gerenciar cooldowns - Especialmente para\nduelistas, lutar em torno dos tempos de recarga é essencial.\n\n-  Posicionamento - Flanquear é geralmente mais eficaz que\natacar pela frente.\n\n-  Conheça seus limites - Como classes de alto risco/alta\nrecompensa, saber quando recuar é tão importante quanto\nsaber quando avançar."
    },
    {
      "numero": 15,
      "conteudo": "# MAGOS\n\nCampeões com foco em habilidades, especializados em dano em área e controle de grupo. Seu poder se baseia principalmente em poder de habilidade (AP) e aceleração de habilidade. O objetivo dos magos é encaixar combos de habilidades, embora possam ter seu dano mitigado ou completamente evitado se inimigos tiverem tempo para reagir.\n\n## PONTOS POSITIVOS\n- Dano em área significativo.\n- Habilidades de controle de grupo.\n- Capacidade de focar alvos prioritários com alcance.\n- Eficácia contra atiradores e lutadores.\n\n## PONTOS NEGATIVOS\n- Extremamente frágeis.\n- Dependência da precisão de habilidades (skillshots).\n- Vulneráveis a assassinos.\n- Dificuldades contra tanques.\n\nAlém de seu potencial de dano, magos podem usar suas habilidades defensivas e de controle para manter inimigos longe de seu time.\n\n13"
    },
    {
      "numero": 16,
      "conteudo": "TIPOS DE MAGOS: MAGOS DE BURST\n\nMagos com capacidade de causar dano explosivo em curto período de tempo, eliminando alvos prioritários rapidamente.\n\nPONTOS POSITIVOS\n- Combo explosivo de habilidades.\n- Capacidade de abater alvos prioritários ou com baixa vida.\n- Potencial para eliminar alvos frágeis instantaneamente.\n\nPONTOS NEGATIVOS\n- Dependência do tempo de recarga de combos completos.\n- Dano pode ser mitigado ou evitado com habilidades de mobilidade.\n- Dificuldade para enfrentar inimigos diretamente (preferem flanquear).\n\nEstilo de jogo: preferem lutar pelos flancos e punir adversários frágeis fora de posição, aproveitando locais sem visão. Devem economizar habilidades para alvos prioritários em vez de gastá-las em tanques ou lutadores.\n\nExemplos: Ahri, Brand, Annie, Karma, Lissandra, Neeko, LeBlanc, Orianna, Seraphine, Syndra, Twisted Fate, Veigar, Vex, Zoe.\n\n14"
    },
    {
      "numero": 17,
      "conteudo": "TIPOS DE MAGOS: MAGOS DE BATALHA\n\nMagos com habilidades de sobrevivência em seus kits, especializados em controle de terreno e combates prolongados.\n\nPONTOS POSITIVOS\n- Habilidades de sustentação (curas, escudos, resistências).\n- Controle de áreas amplas no mapa.\n- Dano constante em área.\n- Mais eficazes contra assassinos que outros magos.\n\nPONTOS NEGATIVOS\n- Early game fraco.\n- Dificuldade para focar alvos específicos.\n- Menos eficazes contra tanques.\n- Vulneráveis a inimigos com maior mobilidade e alcance.\n\nEstilo de jogo: preferem ficar próximos aos inimigos para aplicar dano constante, usando suas habilidades de sustentação para sobreviver. Tendem a focar primeiro na frontline inimiga antes de avançar para alvos prioritários.\n\nExemplos: Anivia, Aurelion Sol, Cassiopeia, Karthus, Malzahar, Rumble, Ryze, Sylas, Swain, Viktor, Taliyah, Vladimir\n\n15"
    },
    {
      "numero": 18,
      "conteudo": "# TIPOS DE MAGOS: MAGOS DE ARTILHARIA\n\nEspecialistas em habilidades de longo alcance, capazes de atingir inimigos além de sua própria visão.\n\n---\n\n## PONTOS POSITIVOS\n\n- Alcance excepcional de habilidades.\n- Capacidade de causar dano sem exposição direta.\n- Coddowns relativamente menores.\n\n---\n\n## PONTOS NEGATIVOS\n\n- Mobilidade reduzida.\n- Capacidade de dano um pouco menor que outros magos.\n- Extremamente vulneráveis quando focados.\n\n---\n\nEstilo de jogo: devem manter-se a distância safa, fora da visão inimiga sempre que possível. O posicionamento é crítico, pois têm poucos recursos defensivos caso sejam focados.\n\nExemplos: Hwei, Jayce, Lux, Vel'Koz, Xerath, Ziggs.\n\n---\n\n16"
    },
    {
      "numero": 19,
      "conteudo": "# DICAS PARA JOGAR DE MAGO\n\nO marketing de afiliados é uma das formas mais populares e\nacessíveis de ganhar dinheiro online. Com a possibilidade de\ntrabalhar de qualquer lugar e a liberdade de escolher os produtos\nou serviços que você promove, o marketing de afiliados oferece\numa oportunidade única para quem busca independência\nfinanceira.\n\nNeste eBook, vamos explorar os fundamentos do marketing de\nafiliados, começando com uma visão geral do que ele é e como\nfunciona. Vamos discutir como você pode encontrar um nicho\nlucrativo, escolher os programas de afiliados certos e começar a\npromover produtos de maneira eficaz. Além disso, vamos\nabordar as melhores práticas para construir uma presença online\nforte e estratégias para maximizar seus ganhos.\n\nSe você está apenas começando ou procurando maneiras de\nmelhorar seus esforços atuais, este guia fornecerá as\nferramentas e o conhecimento necessários para ter sucesso no\nmarketing de afiliados.\n\n17"
    },
    {
      "numero": 20,
      "conteudo": "CONTROLADORES/SUPORTES\n\nCampeões focados em utilidade para o time, tanto protegendo\naliados quanto mantendo inimigos afastados. Não dependem\nsignificativamente de ouro ou nível para serem funcionais,\npodendo até se sacrificar para salvar campeões mais importantes.\n\nPONTOS POSITIVOS\n\n-  Alta utilidade para o time.\n\n-  Eficácia mesmo com poucos\nrecursos.\n\n-  Capacidade de proteger ou\nfacilitar jogadas dos carrys.\n\nPONTOS NEGATIVOS\n\n-  Frágeis quando comparados às\noutras classes.\n\n-  Poucos recursos de mobilidade\npara reposicionamento.\n\n-  Dependente da proximidade do\ntime para eficácia máxima.\n\nSeu papel principal é identificar e neutralizar ameaças ao time,\nespecialmente aos carregadores, protegendo os carrys e usando de\nsua utilidade para os manter ao máximo possível nas lutas em equipe.\n\n18"
    },
    {
      "numero": 21,
      "conteudo": "# TIPOS DE CONTROLADORES: ENCANTADORES\n\nA face mais passiva dos controladores, focados exclusivamente em fortalecer e proteger aliados.\n\n---\n\n## PONTOS POSITIVOS SE\n\n- Curas, escudos e amplificações de dano/buffs.\n- Alcance longo para assistir aliados.\n- Algumas habilidades de controle para defesa.\n\n---\n\n## PONTOS NEGATIVOS\n\n- Baixa capacidade de dano.\n- Alvos fáceis quando mal posicionados.\n- Pouca ou nenhuma mobilidade.\n\n---\n\nEstilo de jogo: devem jogar defensivamente, mesmo em vantagem. Suas habilidades de CC são mais úteis para acompanhar engages aliados ou defender carrys, não para iniciar lutas. Prioridade absoluta deve ser proteger carregadores, não desperdiçando recursos defensivos em aliados mais resistentes.\n\nExemplos: Janna, Karma, Lulu, Milio, Nami, Renata Glasc, Senna, Seraphine, Sona, Soraka, Taric, Yuumi.\n\n---\n\n19"
    },
    {
      "numero": 22,
      "conteudo": "# TIPOS DE CONTROLADORES: APANHADORES\n\nControladores mais agressivos que abrem espaço para seus carrys atuarem, criando oportunidades e ameaças constantes no mapa e rota.\n\n## PONTOS POSITIVOS\n- Habilidades de controle de longo alcance.\n- Maior capacidade de dano que encantadores.\n- Forte potencial de roaming e picks offs.\n- Capacidade de iniciar lutas favoráveis.\n\n## PONTOS NEGATIVOS\n- Dependência de skillshots precisos.\n- Pouco valor em caso de erro.\n- Vulneráveis a contra-engages.\n\nEstilo de jogo: buscam constantemente jogadas ofensivas, seja através de roaming ou aproveitando mal posicionamento inimigo. Em teamfights, podem tanto buscar inimigos fora de posição quanto usar seu CC para proteger aliados.\n\nExemplos: Bardo, Blitzcrank, Jhin, Ivern, Morgana, Neeko, Pyke, Thresh, Zyra.\n\n20"
    },
    {
      "numero": 23,
      "conteudo": "# DICAS PARA JOGAR DE CONTROLADOR\n\n- Visão é poder - Como controlador, você deve ser o principal responsável pela visão do mapa, usando wards estrategicamente.\n\n- Identifique o carry do seu time - Nem sempre o ADC é o melhor jogador para proteger/potencializar. Observe quem está performando melhor.\n\n- Timing de CC - Especialmente para apanhadores, um CC bem colocado pode definir toda uma luta.\n\n- Posicionamento adaptativo - Como encantador, fique perto de seus carrys; como apanhador, busque ângulos para iniciar jogadas.\n\n- Aprenda a sacrificar-se - Às vezes, morrer para salvar seu carry é a jogada correta.\n\n- Economize recursos críticos - Não desperdice habilidades defensivas importantes em alvos que não são prioridade.\n\n- Antecipe ameaças - Identifique quem no time inimigo representa maior perigo para seus carrys e adapte seu jogo para neutralizá-lo.\n\n21"
    },
    {
      "numero": 24,
      "conteudo": "# TANQUES\n\nCampeões extremamente resistentes cujas habilidades giram em torno de controles de grupo (CC) e aprimoramentos de resistências (defesa física, resistência mágica, mitigação de dano, escudos). Geralmente constroem itens que aumentam suas defesas e HP, o que também possibilita sua utilização na rota de suporte como linha de frente do time.\n\n---\n\n## PONTOS POSITIVOS\n\n- Alta resistência a dano.\n- Controle de terreno por presença.\n- Úteis em teamfights mesmo em desvantagem.\n- Capacidade de proteger aliados e/ou iniciar combates.\n\n---\n\n## PONTOS NEGATIVOS\n\n- Alcance limitado (majoritariamente melee).\n- Dano geralmente baixo.\n- Dependência da equipe para seguir suas iniciações.\n- Fraco em lutas 2v2 na fase de rota no top.\n\nSimilar aos apanhadores, podem controlar áreas com sua presença e, em certos casos, prender times inteiros de uma vez. Mesmo em desvantagem, tanques nunca estão completamente fora do jogo, pois ainda podem absorver dano e usar suas habilidades de CC em lutas de equipe.\n\n---\n\n22"
    },
    {
      "numero": 25,
      "conteudo": "TIPOS DE TANQUES: GUARDIÕES\n\nA parcela mais defensiva dos tanques, com foco em proteger aliados com escudos e aprimoramentos de defesa.\n\nPONTOS POSITIVOS\n- Habilidades para obter escudos e aumentar defesas aliadas.\n- Excelentes para desengage (impedir iniciações inimigas).\n- Alta utilidade para proteção de equipe.\n\nPONTOS NEGATIVOS\n- Engage menos poderoso que Vanguardas.\n- Melhor desempenho com uso reativo de habilidades.\n\nEstilo de jogo: permanecer próximo ao time, protegendo carrys e identificando/neutralizando ameaças à backline usando CC defensivo. Funcionam melhor reagindo às ações inimigas do que iniciando jogadas.\n\nExemplos: Braum, Galio, K'Sante, Poppy, Shen, Taric, Tahm Kench.\n\n23"
    },
    {
      "numero": 26,
      "conteudo": "TIPOS DE TANQUES: VANGUARDA\n\nPersonagens tanques mais agressivos, especializados em iniciar combates e prender adversários.\n\nPONTOS POSITIVOS\n- Excelentes iniciadores de lutas (engage).\n- Capacidade de prender campeões inimigos.\n- Habilidades de CC em área.\n- Alcance efetivo para focar alvos prioritários.\n\nPONTOS NEGATIVOS\n- Dano insuficiente para eliminar alvos sem apoio da equipe.\n- Podem ficar vulneráveis após usar habilidades de iniciação.\n\nEstilo de jogo: constantemente buscam oportunidades para iniciar lutas favoráveis, preferindo tomar a iniciativa em vez de reagir. Podem focar alvos prioritários com seu alcance, mas dependem da equipe para seguir suas iniciações e garantir abates.\n\nExemplos: Alistar, Amumu, Gragas, Leona, Malphite, Naokai, Nautilus, Nunu, Ornn, Rammus, Sion, Rell, Sejuani, Skarner, Zac.\n\n24"
    },
    {
      "numero": 27,
      "conteudo": "-  Conheça os timings de engage - Especialmente para Vanguardas, saiba\nidentificar o momento certo para iniciar lutas.\n\n-  Priorize objetivos sobre kills - Como tanque, sua presença é crucial para\nassegurar dragões, barões e torres.\n\n-  Sacrifique-se estrategicamente - Às vezes, morrer para que seu time\nconsiga objetivos ou kills importantes é a jogada correta.\n\n-  Abuse do seu controle de terreno - Mesmo sem lutar, sua presença pode\nimpedir inimigos de acessar certas áreas.\n\n-  Construa itens situacionais - Adapte suas compras com base nas\nprincipais ameaças inimigas (mais armadura vs AD, mais MR vs AP).\n\n-  Seja os olhos do time - Como frontline, você tem posição privilegiada\npara observar o campo de batalha e fazer calls.\n\n-  Pratique o peeling - Para Guardiões especialmente, aprender a\n\"descascar\" ameaças dos seus carrys é essencial.\n\n-  Tenha paciência - Tanques muitas vezes não brilham individualmente,\nmas seu impacto no resultado final da partida é enorme."
    },
    {
      "numero": 28,
      "conteudo": "# LUTADORES\n\nCampeões de curta distância que se destacam tanto em causar quanto em resistir a dano. São notáveis em combates prolongados graças à sua durabilidade e habilidades defensivas. Geralmente têm vantagem contra assassinos devido à capacidade de sobreviver ao dano explosivo, e também contra tanques por causa de seu dano sustentado.\n\n## PONTOS POSITIVOS\n\n- Boa combinação de dano e resistência.\n- Excelentes em combates prolongados.\n- Eficazes contra assassinos e tanques.\n\n## PONTOS NEGATIVOS\n\n- Vulneráveis a controle de grupo (CC).\n- Alcance limitado, sofrendo contra magos e atiradores.\n- Podem ser kiteados por campeões com alta mobilidade.\n\nPodem muitas vezes fazer o papel de fronte no time, sendo iniciadores. Embora, não seja esse seu papel principal.\n\n26"
    },
    {
      "numero": 29,
      "conteudo": "TIPOS DE LUTADORES: COLOSSOS\n\nLutadores pesados que avançam agressivamente contra seus inimigos, causando dano massivo enquanto resistem bem.\n\nPONTOS POSITIVOS\n- Excelente equilíbrio entre dano e resistência.\n- Ótimos para split push.\n- Forçam inimigos a entrar em seu alcance para combatê-los.\n- Eficazes em teamfights quando flanqueiam.\n\nPONTOS NEGATIVOS\n- Falta de mobilidade, dependendo principalmente de velocidade de movimento.\n- Podem ser kiteados facilmente.\n\nEstilo de jogo: costumam ser excelentes split pushers, obrigando inimigos a parar seu push em rota, fazendo muitas vezes com quem sejam necessários dois ou mais inimigos. Mas isso não significa que estejam apenas limitados a puxar rotas, são ótimos também em lutas em equipe por conseguirem lutar por longos períodos de tempo. Porém, trabalham melhor lutando pelos flancos inimigos, buscando abater os carrys.\n\nExemplos: Ratrox, Dr. Mundo, Darius, Sett, Mordekaiser, Garen, Illaoi, Nasus, Shyvana, Sion, Volibear, Yorick, Urgot, Trundle, Udyr\n\n27"
    },
    {
      "numero": 30,
      "conteudo": "TIPOS DE LUTADORES: DIVERS\n\nLutadores com alta mobilidade, especializados em alcançar alvos prioritários inimigos.\n\nPONTOS POSITIVOS\n\n-  Mobilidade superior para acessar a backline inimiga.\n-  Excelem em escaramuças menores (2v2, 3v3).\n-  Bons para pick-offs.\n\nPONTOS NEGATIVOS\n\n-  Mais frágeis que os Colossos.\n-  Não ideais para iniciar teamfights 5v5.\n-  Podem ser eliminados rapidamente se entrarem na luta no momento errado.\n\nEstilo de jogo: em teamfights, é recomendado que esperem um engage inicial e aproveitem o caos para eliminar alvos prioritários, em vez de serem os primeiros a iniciar o combate.\n\nExemplos: Briar, Camille, Diana, Elise, Hecarim, Jarvan IV, Lee Sin, Olaf, Pantheon, Rek'sai, Renekton, Rengar, Vi, Warwick, Wukong, Xin Zhao.\n\n28"
    },
    {
      "numero": 31,
      "conteudo": "# DICAS PARA JOGAR DE LUTADOR\n\n- Domine o trading pattern - Lutadores são especialistas em trocas curtas. Aprenda exatamente quando engajar e desengajar baseado nos cooldowns de suas habilidades e do oponente.\n\n- Gerencie a onda de minions - Manipular corretamente a onda pode ser a diferença entre dominar a rota ou ficar vulnerável a ganks. Aprenda a congelar perto de sua torre quando em desvantagem e criar slow push quando deseja fazer roaming.\n\n- Conheça seus power spikes - Para lutadores, certos níveis (geralmente 3, 5/6, 9) e itens completados criam janelas de poder significativas. Force lutas quando atingir esses marcos.\n\n- Faça visão proativa - Como lutadores frequentemente jogam em lanes laterais, a visão é crucial. Além de wards defensivos, use wards ofensivos para planejar dives ou identificar o jungler inimigo.\n\n- Pratique o conceito de espaçamento - Mantenha-se sempre na distância perfeita: perto o suficiente para ameaçar, longe o suficiente para reagir a engages inimigos.\n\n29"
    },
    {
      "numero": 32,
      "conteudo": "- Aprenda a split push eficientemente - Para Colossos especialmente, saber quando e como fazer split push é essencial. Monitore o mapa constantemente e recue quando necessário.\n\n- Entenda seu papel em teamfights - Como Diver, seu foco é eliminar os carrys inimigos. Como Colosso, você pode tanto proteger seus carrys quanto focar os inimigos, dependendo da situação.\n\n- Adapte suas builds - Lutadores têm flexibilidade de build. Aprenda quando focar em dano, quando focar em resistência, e quando buscar um equilíbrio.\n\n- Gerencie recursos - Muitos lutadores dependem de recursos como mana, energia ou habilidades com cooldowns específicos. Aprenda a gerenciar esses recursos eficientemente.\n\n- Pratique o peeling para si mesmo - Ao contrário de tanques, lutadores geralmente precisam se proteger sozinhos. Aprenda a usar suas habilidades defensivamente quando necessário.\n\n- Domine os matchups - Lutadores frequentemente enfrentam espelhos ou oponentes similares. Conhecer as nuances de cada matchup é crucial para o sucesso na lane.\n\n30"
    },
    {
      "numero": 33,
      "conteudo": "# ESPECIALISTAS\n\nCampeões que não se encaixam perfeitamente em nenhuma das outras classes, possuindo kits únicos que os tornam difíceis de classificar. Geralmente são escolhidos para preencher lacunas específicas na composição do time ou para explorar pontos fracos do time inimigo.\n\n## PONTOS POSITIVOS\n\n- Kits únicos e imprevisíveis.\n- Excelentes para preencher lacunas em composições.\n- Dificultam a adaptação do inimigo.\n\n## PONTOS NEGATIVOS\n\n- Alta curva de aprendizado.\n- Podem ser menos confiáveis que classes tradicionais.\n- Requerem compreensão profunda do jogo.\n\nEmbora alguns especialistas possam parecer pertencer a outras classes, seus kits possuem mecânicas únicas que os diferenciam significativamente.\n\n31"
    },
    {
      "numero": 34,
      "conteudo": "# EXEMPLOS DE ESPECIALISTAS\n\n**Akshan** - Combina elementos de assassino e atirador com sua mecânica única de reviver aliados.\n\n**Aurelion Sol** - Magos de batalha com mecânica única de estrelas orbitantes e escala infinita.\n\n**Azir** - Combina elementos de mago e atirador com seus soldados.\n\n**Bardo** - Controlador com mecânica única de coleta de sinos e túneis.\n\n**Bel'Veth** - Duelista com mecânica única de evolução e criação de minions.\n\n**Camille** - Diver com foco extremo em picks isolados.\n\n**Fiddlesticks** - Assassino com mecânica única de visão e terror psicológico.\n\n**Gangplank** - Combina elementos de lutador e mago com seus barris.\n\n**Gnar** - Lutador com transformação entre formas de ranged e melee.\n\n**Graves** - Atirador com mecânica única de recarga e esquiva.\n\n**Gwen** - Duelista com mecânica única de imunidade e corte.\n\n**Heimerdinger** - Mago com foco em controle de área através de torretas.\n\n**Ivern** - Controlador com mecânica única de interação com a selva.\n\n**Jayce** - Combina elementos de lutador e mago com sua transformação.\n\n**Kai'Sa** - Atiradora com evolução de habilidades única.\n\n**Kayle** - Combina elementos de lutador e mago com transformação e escala.\n\n**Kayn** - Assassino/Duelista com transformação baseada no tipo de alvo.\n\n**Kindred** - Atirador com mecânica única de marcação de caça.\n\n**Kled** - Duelista com mecânica única de montaria e coragem.\n\n**Nidalee** - Assassina com transformação entre formas humana e felina.\n\n**Quinn** - Atiradora com foco em roaming e picks.\n\n**Samira** - Atiradora com mecânica única de combo e estilo.\n\n**Singed** - Lutador com estilo de jogo único de envenenamento.\n\n**Teemo** - Combina elementos de atirador e mago com armadilhas.\n\n**Twitch** - Atirador com furtividade e veneno.\n\n**Vayne** - Atiradora com foco em dano verdadeiro e mobilidade.\n\n**Yorick** - Lutador com criação de servos e controle de área.\n\n**Zeri** - Atiradora com mecânica única de movimento e carregamento.\n\n32"
    },
    {
      "numero": 35,
      "conteudo": "# COMO ESCOLHER SUA CLASSE\n\nAgora que conhecemos as diferentes classes e subclasses do Wild Rift, como escolher qual se adequa melhor ao seu estilo de jogo?\n\n## CONSIDERE SEUS PONTOS FORTES\n\n- **Precisão mecânica**: Se você tem boa mira com skillshots, considere magos de artilharia ou apanhadores.\n\n- **Tomada de decisão rápida**: Se pensa rápido sob pressão, assassinos ou duelistas podem ser ideais.\n\n- **Visão estratégica**: Se tem boa leitura de mapa, tanques vanguardas ou especialistas podem se adequar.\n\n- **Paciência e disciplina**: Se prefere jogar de forma mais calculada, atiradores hiper carregadores ou encantadores são boas opções.\n\n## AVALIE SEU ESTILO DE JOGO PREFERIDO\n\n- **Agressivo**: Assassinos, duelistas, early carrys\n- **Defensivo**: Encantadores, guardiões, hiper carregadores\n- **Versátil**: Lutadores, magos de batalha, especialistas\n- **Tático**: Apanhadores, vanguardas, magos de artilharia\n\n33"
    },
    {
      "numero": 36,
      "conteudo": "## EXPERIMENTE DIFERENTES CLASSES\n\nNão se limite a uma única classe inicialmente. Experimente pelo menos 2-3 campeões de cada classe principal para entender qual se adequa melhor ao seu estilo.\n\n## CONSIDERE SEU PAPEL PREFERIDO\n\nCada rota tende a favorecer certas classes:\n\n- **Top**: Lutadores, tanques, alguns especialistas\n- **Jungle**: Assassinos, divers, tanques\n- **Mid**: Magos, assassinos, alguns duelistas\n- **ADC**: Atiradores\n- **Suporte**: Controladores, tanques\n\n## DESENVOLVA UM POOL DE CAMPEÕES\n\nUma vez que identifique as classes que mais gosta, desenvolva um pool de 3-5 campeões que cubram diferentes situações e sejam complementares.\n\nLembre-se: dominar uma classe leva tempo e prática. Escolha aquela que você genuinamente gosta de jogar, não apenas a que parece mais forte no momento.\n\n34"
    }
  ]
}